"""e.g hacker 👉 hackerz 😌👌 ➣➢➤teddy cat alien dinosa welcome drink bomb bike
goodnight devil robot boa smile toilet bull fox spider winter 
love snowman home guitar pistol whale crab piano man 
lion elephant snail fort fish radio computer boy gn hello

I think that all...  @GbeshMod 
"""

import asyncio
from telethon import events
from telethon.tl.types import ChannelParticipantsAdmins
from platform import uname


n = str(ALIVE_NAME) if ALIVE_NAME else Var.BOT_N_N




A = (n + "Anonymous \n"
"─────█─▄▀█──█▀▄─█─────\n"
"────▐▌──────────▐▌────\n"
"────█▌▀▄──▄▄──▄▀▐█────\n"
"───▐██──▀▀──▀▀──██▌───\n"
"──▄████▄──▐▌──▄████▄──\n")

B = ("───▄▀▀▀▄▄▄▄▄▄▄▀▀▀▄───\n"
"───█▒▒░░░░░░░░░▒▒█───\n"
"────█░░█░░░░░█░░█────\n"
"─▄▄──█░░░▀█▀░░░█──▄▄─\n"
"█░░█─▀▄░░░░░░░▄▀─█░░█\n")

C = ("──────▄▀▄─────▄▀▄\n"
"─────▄█░░▀▀▀▀▀░░█▄\n"
"─▄▄──█░░░░░░░░░░░█──▄▄\n"
"█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█\n")

D = ("▒▒▄▀▀▀▀▀▄▒▒▒▒▒▄▄▄▄▄▒▒▒\n"
"▒▐░▄░░░▄░▌▒▒▄█▄█▄█▄█▄▒\n"
"▒▐░▀▀░▀▀░▌▒▒▒▒▒░░░▒▒▒▒\n"
"▒▒▀▄░═░▄▀▒▒▒▒▒▒░░░▒▒▒▒\n"
"▒▒▐░▀▄▀░▌▒▒▒▒▒▒░░░▒▒▒▒\n")

E = ("░▄▄▄▄░\n"
"▀▀▄██►\n"
"▀▀███►\n"
"░▀███►░█►\n"
"▒▄████▀▀\n")

F = ("█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█\n"
"█░░╦─╦╔╗╦─╔╗╔╗╔╦╗╔╗░░█\n"
"█░░║║║╠─║─║─║║║║║╠─░░█\n"
"█░░╚╩╝╚╝╚╝╚╝╚╝╩─╩╚╝░░█\n"
"█▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█\n")

G = ("──────▄▀─\n"
"─█▀▀▀█▀█─\n"
"──▀▄░▄▀──\n"
"────█────\n"
"──▄▄█▄▄──\n")

H = ("─▄▀▀███═◯\n"
"▐▌▄▀▀█▀▀▄\n"
"█▐▌─────▐▌\n"
"█▐█▄───▄█▌\n"
"▀─▀██▄██▀\n")

I = ("───────────▀▄\n"
"──█▄▄▄▄▄███▀▄─▄▄\n"
"▄▀──▀▄─▀▀█▀▀▄▀──▀▄\n"
"▀▄▀▀█▀▀████─▀▄──▄▀\n"
"──▀▀──────────▀▀\n")

J = ("O────────────────O\n"
"█▓██▄────────────█\n"
"█▓▓░▀▄▀░░░░░░░░░░█\n"
"█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█\n"
"█────────────────█\n")

K = ("───▄█▌─▄─▄─▐█▄\n"
"───██▌▀▀▄▀▀▐██\n"
"───██▌─▄▄▄─▐██\n"
"───▀██▌▐█▌▐██▀\n"
"▄██████─▀─██████▄\n")

L = ("░░░░░░░▄█▄▄▄█▄\n"
"▄▀░░░░▄▌─▄─▄─▐▄░░░░▀▄\n"
"█▄▄█░░▀▌─▀─▀─▐▀░░█▄▄█\n"
"░▐▌░░░░▀▀███▀▀░░░░▐▌\n"
"████░▄█████████▄░████\n")

M = ("▄▄▀█▄───▄───────▄\n"
"▀▀▀██──███─────███\n"
"░▄██▀░█████░░░█████░░\n"
"███▀▄███░███░███░███░▄\n"
"▀█████▀░░░▀███▀░░░▀██▀\n")

N = ("╔══╗░░░░╔╦╗░░╔═════╗\n"
"║╚═╬════╬╣╠═╗║░▀░▀░║\n"
"╠═╗║╔╗╔╗║║║╩╣║╚═══╝║\n"
"╚══╩╝╚╝╚╩╩╩═╝╚═════╝\n")

O = ("───────███\n"
"───────███\n"
"▄█████▄█▀▀\n"
"─▀█████\n"
"──▄████▄\n")


P = ("▄█▀─▄▄▄▄▄▄▄─▀█▄\n"
"▀█████████████▀\n"
"────█▄███▄█\n"
"─────█████\n"
"─────█▀█▀█\n")

HQ = ("───▄▄─▄████▄▐▄▄▄▌\n"
"──▐──████▀███▄█▄▌\n"
"▐─▌──█▀▌──▐▀▌▀█▀\n"
"─▀───▌─▌──▐─▌\n"
"─────█─█──▐▌█\n")

COMBOS = ("──▄──▄────▄▀\n"
"───▀▄─█─▄▀▄▄▄\n"
"▄██▄████▄██▄▀█▄\n"
"─▀▀─█▀█▀▄▀███▀\n"
"──▄▄▀─█──▀▄▄\n")

TOTO = ("░╔╔╩╩╝\n"
"▄██▄\n"
"░░██████▄░░░░░░▄▄▄▄▄▄█\n"
"░░█▀█▀█▀█░░▄░▄████████\n"
"░▄▌▄▌▄▌▄▌░▀▄▄▄▄█▄▄▄▄█▄\n")

DICK = ("█───▄▀▀▀▀▄─▐█▌▐█▌▐██\n"
"█──▐▄▄────▌─█▌▐█─▐▌─\n"
"█──▐█▀█─▀─▌─█▌▐█─▐██\n"
"█──▐████▄▄▌─▐▌▐▌─▐▌─\n"
"███─▀████▀───██──▐██\n")

R = ("░▄░█░░░▄▀▀▀▀▀▄░░░█░▄░\n"
"▄▄▀▄░░░█─▀─▀─█░░░▄▀▄▄\n"
"░░░░▀▄▒▒▒▒▒▒▒▒▒▄▀░░░░\n"
"░░░░░█────▀────█░░░░░\n"
"░░░░░█────▀────█░░░░░\n")

S = ("░░░░░░░░░░░░░░░░▄▓▄\n"
"░░░░▄█▄░░░░░░░░▄▓▓▓▄\n"
"░░▄█████▄░░░░░▄▓▓▓▓▓▄\n"
"░▀██┼█┼██▀░░░▄▓▓▓▓▓▓▓▄\n"
"▄▄███████▄▄▄▄▄▄▄▄█▄▄▄▄\n")

T = ("░▄▀▀▀▀▄░░▄▄\n"
"█░░░░░░▀▀░░█░░░░░░▄░▄\n"
"█░║░░░░██░████████████ \n"
"█░░░░░░▄▄░░█░░░░░░▀░▀\n"
"░▀▄▄▄▄▀░░▀▀\n")

U = ("░▄▌░░░░░░░░░▄\n"
"████████████▄\n"
"░░░░░░░░▀▐████\n"
"░░░░░░░░░░░▐██▌\n")

V = ("─────▀▄▀─────▄─────▄\n"
"──▄███████▄──▀██▄██▀\n"
"▄█████▀█████▄──▄█\n"
"███████▀████████▀\n"
"─▄▄▄▄▄▄███████▀\n")


W = ("▄▀─────────────▀▄\n"
"█▄█──█▀█─█▀█─▄█▄█\n"
"─▀██▄▀▄▀─▀▄▀▄██▀\n"
"░░░▄██▀███▀███▄\n"
"░▐▀█▀██▄▄▄██▀█▀▌\n")

X = ("║░█░█░║░█░█░█░║░█░█░║\n"
"║░█░█░║░█░█░█░║░█░█░║\n"
"║░║░║░║░║░║░║░║░║░║░║\n"
"╚═╩═╩═╩═╩═╩═╩═╩═╩═╩═╝\n")

Y = ("───────▄██████▄───────\n"
"──────▐▀▀▀▀▀▀▀▀▌──────\n"
"──────▌▌▀▀▌▐▀▀▐▐──────\n"
"──────▐──▄▄▄▄──▌──────\n"
"───────▌▐▌──▐▌▐───────\n")

Z = ("───▄▀▀▀▀▀───▄█▀▀▀█▄\n"
"──▐▄▄▄▄▄▄▄▄██▌▀▄▀▐██\n"
"──▐▒▒▒▒▒▒▒▒███▌▀▐███\n"
"───▌▒▓▒▒▒▒▓▒██▌▀▐██\n"
"───▌▓▐▀▀▀▀▌▓─▀▀▀▀▀\n")

EE = ("──███▅▄▄▄▄▄▄▄▄▄\n"
"─██▐████████████\n"
"▐█▀████████████▌▌\n"
"▐─▀▀▀▐█▌▀▀███▀█─▌\n"
"▐▄───▄█───▄█▌▄█\n")


RR = ("───▄▄▄\n"
"─▄▀░▄░▀▄\n"
"─█░█▄▀░█\n"
"─█░▀▄▄▀█▄█▄▀\n"
"▄▄█▄▄▄▄███▀\n")

TT = ("─────────█▄██▄█\n"
"█▄█▄█▄█▄█▐█┼██▌█▄█▄█▄█▄█\n"
"███┼█████▐████▌█████┼███\n"
"█████████▐████▌█████████\n")

YY = ("─▀▀▌───────▐▀▀\n"
"─▄▀░◌░░░░░░░▀▄\n"
"▐░░◌░▄▀██▄█░░░▌\n"
"▐░░░▀████▀▄░░░▌\n"
"═▀▄▄▄▄▄▄▄▄▄▄▄▀═\n")

UU = ("░░█▀▀▀▀▀▀▀▀▀▀▀▀▀▀█\n"
"██▀▀▀██▀▀▀▀▀▀██▀▀▀██\n"
"█▒▒▒▒▒█▒▀▀▀▀▒█▒▒▒▒▒█\n"
"█▒▒▒▒▒█▒████▒█▒▒▒▒▒█\n"
"██▄▄▄██▄▄▄▄▄▄██▄▄▄██\n")

II = ("▐▓█▀▀▀▀▀▀▀▀▀█▓▌░▄▄▄▄▄░\n"
"▐▓█░░▀░░▀▄░░█▓▌░█▄▄▄█░\n"
"▐▓█░░▄░░▄▀░░█▓▌░█▄▄▄█░\n"
"▐▓█▄▄▄▄▄▄▄▄▄█▓▌░█████░\n"
"░░░░▄▄███▄▄░░░░░█████░\n")

OO = ("▒▒▒▒▒▒▐███████▌\n"
"▒▒▒▒▒▒▐░▀░▀░▀░▌\n"
"▒▒▒▒▒▒▐▄▄▄▄▄▄▄▌\n"
"▄▀▀▀█▒▐░▀▀▄▀▀░▌▒█▀▀▀▄\n"
"▌▌▌▌▐▒▄▌░▄▄▄░▐▄▒▌▐▐▐▐\n")

PP = ("-✭´-\n"
"¯¨˜“ª¤.¸°¸.¤ª“˜¨¨¯¯¨˜“ª¤.¸°¸.¤\n"
"..¤ª“˜¨¨¯¯¨¨˜“ª¤. : ☆ ☆ ☆\n"
"☆ ☆ ☆ ƓƠƠƊ ƝƖƓӇƬ ☆ ☆ ☆\n"
"……-✭´-.*_-`☆´-\n"
".¤ª“˜¨¨¯¯¨¨˜“ª¤.☆.¤ ª“˜¨°¸.¤ª\n"
"Good night , I go to sleep.-\n")

AA = ("┈┈┈┈┈┈╱╱╱▕╲╱▏╲┈┈┈\n"
"┈┈┈┈┈▕╱╱╱▕╱╲▏╲▏┈┈\n"
"┈╭━╮┈▕╱╱╭╮╭╮╲╲▏┈┈\n"
"┈┃┈┗╮▕╱▏┳╭╮┳▕╲▏┈┈\n"
"┈┃┈╭╯▕┊╲╰━━╯╱┊▏┈┈\n"
"┈┣━┫┈▕┊┊▔▏▕▔┊┊▏┈┈\n"
"┏┓┏┳━━┳┓┏┓┏━━┓┏┓\n"
"┃┗┛┃━━┫┃┃┃┃╭╮┃┃┃\n"
"┃┏┓┃━━┫┗┫┗┫╰╯┃┗┛\n"
"┗┛┗┻━━┻━┻━┻━━┛┏┓\n"
"┈┈┈┈┈┈┈┈┈┈┈┈┈┈┗┛\n")

@borg.on(admin_cmd(pattern=r"hackerz"))
async def nandyhacker(hacker):
    await hacker.edit(A)
@borg.on(admin_cmd(pattern=r"teddyz"))
async def nandyteddy(teddy):
    await teddy.edit(B)
@borg.on(admin_cmd(pattern=r"catz"))
async def nandycat(cat):
    await cat.edit(C)
@borg.on(admin_cmd(pattern=r"alienz"))
async def nandyalien(alien):
    await alien.edit(D)	
@borg.on(admin_cmd(pattern=r"dinosaz"))
async def nandydinosaur(dinosaur):
    await dinosaur.edit(E)
@borg.on(admin_cmd(pattern=r"welcomez"))
async def nandywelcome(welcome):
    await welcome.edit(F)
@borg.on(admin_cmd(pattern=r"drinkz"))
async def nandydrink(drink):
    await drink.edit(G)
@borg.on(admin_cmd(pattern=r"bombz"))
async def nandybomb(bomb):
    await bomb.edit(H)
@borg.on(admin_cmd(pattern=r"bikez"))
async def nandybike(bike):
    await bike.edit(I)
@borg.on(admin_cmd(pattern=r"goodnightz"))
async def nandygoodnight(goodnight):
    await goodnight.edit(J)
@borg.on(admin_cmd(pattern=r"devilz"))
async def nandydevil(devil):
    await devil.edit(K)
@borg.on(admin_cmd(pattern=r"robotz"))
async def nandyrobot(robot):
    await robot.edit(L)
@borg.on(admin_cmd(pattern=r"boaz"))
async def nandyboa(boa):
    await boa.edit(M)
@borg.on(admin_cmd(pattern=r"smilez"))
async def nandysmile(smile):
    await smile.edit(N)
@borg.on(admin_cmd(pattern=r"toiletz"))
async def nandytoilet(toilet):
    await toilet.edit(O)
@borg.on(admin_cmd(pattern=r"bullz"))
async def nandybull(bull):
    await bull.edit(P)
@borg.on(admin_cmd(pattern=r"foxz"))
async def nandyfox(fox):
    await fox.edit(HQ)
@borg.on(admin_cmd(pattern=r"spiderz"))
async def nandyspider(spider):
    await spider.edit(COMBOS)
@borg.on(admin_cmd(pattern=r"winterz"))
async def nandywinter(winter):
    await winter.edit(TOTO)
@borg.on(admin_cmd(pattern=r"lovez"))
async def nandylove(love):
    await love.edit(DICK)
@borg.on(admin_cmd(pattern=r"snowmanz"))
async def nandysnowman(snowman):
    await snowman.edit(R)
@borg.on(admin_cmd(pattern=r"homez"))
async def nandyhome(home):
    await home.edit(S)
@borg.on(admin_cmd(pattern=r"guitarz"))
async def nandyguitar(guitar):
    await guitar.edit(T)
@borg.on(admin_cmd(pattern=r"pistolz"))
async def nandypistol(pistol):
    await pistol.edit(U)
@borg.on(admin_cmd(pattern=r"whalez"))
async def nandywhale(whale):
    await whale.edit(V)
@borg.on(admin_cmd(pattern=r"crabz"))
async def nandycrab(crab):
    await crab.edit(W)
@borg.on(admin_cmd(pattern=r"pianoz"))
async def nandypiano(piano):
    await piano.edit(X)
@borg.on(admin_cmd(pattern=r"manz"))
async def nandyman(man):
    await man.edit(Y)
@borg.on(admin_cmd(pattern=r"lionz"))
async def nandylion(lion):
    await lion.edit(Z)
@borg.on(admin_cmd(pattern=r"elephantz"))
async def nandyelephant(elephant):
    await elephant.edit(EE)
@borg.on(admin_cmd(pattern=r"snailz"))
async def nandysnail(snail):
    await snail.edit(RR)
@borg.on(admin_cmd(pattern=r"fortz"))
async def nandyfort(fort):
    await fort.edit(TT)
@borg.on(admin_cmd(pattern=r"fishz"))
async def nandyfish(fish):
    await fish.edit(YY)
@borg.on(admin_cmd(pattern=r"radioz"))
async def nandyradio(radio):
    await radio.edit(UU)
@borg.on(admin_cmd(pattern=r"computerz"))
async def nandycomputer(computer):
    await computer.edit(II)    
@borg.on(admin_cmd(pattern=r"boyz"))
async def nandyboy(boy):
    await boy.edit(OO)
@borg.on(admin_cmd(pattern=r"gnz"))
async def nandygn(gn):
    await gn.edit(PP)
@borg.on(admin_cmd(pattern=r"helloz"))
async def nandyhello(hello):
    await hello.edit(AA)    
    
CMD_HELP.update({
    "akpo":"this plugin is made by @GbeshMod it has more than 30 Commands Please always include  z after any of this commands...\n e.g hacker 👉 hackerz ◉😌👌 ➤➤➤  teddy cat alien dinosa welcome drink bomb bike \n goodnight devil robot boa smile toilet bull fox spider winter \n love snowman home guitar pistol whale crab piano man \n lion elephant snail fort fish radio computer boy gn hello "})
    